//-----------------------------------------------------------------------------
//
// ビルボードの処理 ヘッダー [billboard.h]
// Author: Souta Tomoe
//
//-----------------------------------------------------------------------------
#ifndef _BILLBOARD_H_
#define _BILLBOARD_H_
#include "main.h"

//-----------------------------------------------------------------------------
// マクロ定義
//-----------------------------------------------------------------------------
#define BILLBOARD_WIDTH (50 / 2)
#define BILLBOARD_HEIGHT (50)
//-----------------------------------------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitBillboard(void);
void UninitBillboard(void);
void UpdateBillboard(void);
void DrawBillboard(void);

#endif

