//-----------------------------------------------------------------------------
//
// 弾の処理 ヘッダー [bullet.h]
// Author: Souta Tomoe
//
//-----------------------------------------------------------------------------
#ifndef _BULLET_H_
#define _BULLET_H_
#include "main.h"

//-----------------------------------------------------------------------------
// マクロ定義
//-----------------------------------------------------------------------------
#define BULLET_MAX (256)														// 弾の最大数
#define BULLET_WIDTH (25 / 2)													// 弾の幅
#define BULLET_HEIGHT (25 / 2)													// 弾の高さ

//-----------------------------------------------------------------------------
// 弾の構造体
//-----------------------------------------------------------------------------
typedef struct
{
	D3DXMATRIX mtxWorld;														// ワールドマトリックス
	D3DXVECTOR3 pos;		// 位置
	D3DXVECTOR3 rot;															// 向き
	D3DXVECTOR3 move;															// 移動
	int nLifeTime;																// 寿命
	bool bUse;																	// 使用状態
	bool bHitWall;
} Bullet;

//-----------------------------------------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitBullet(void);
void UninitBullet(void);
void UpdateBullet(void);
void DrawBullet(void);
void SetBullet(D3DXVECTOR3 pos, D3DXVECTOR3 move);

#endif

