//-----------------------------------------------------------------------------
//
// HPバーの処理 ヘッダー [healthbar.h]
// Author: Souta Tomoe
//
//-----------------------------------------------------------------------------
#ifndef _HPBAR_H_
#define _HPBAR_H_

#include "main.h"

//-----------------------------------------------------------------------------
// マクロ定義
//-----------------------------------------------------------------------------
#define HPBAR_WIDTH (1000 / 20)	// HPバーの幅
#define HPBAR_HEIGHT (98 / 20)	// HPバーの高さ
#define HPBAR_LAYER (2)			// HPバーの層 (後ろと前で2枚)
#define HPBAR_HEIGHT_FROM_OBJ (50)	// 対象オブジェからの高さ

//-----------------------------------------------------------------------------
// 構造体
//-----------------------------------------------------------------------------
typedef struct
{
	D3DXMATRIX mtxWorld;				// ワールドマトリックス
	LPDIRECT3DVERTEXBUFFER9 pVtxBuff;	// 頂点バッファ
	LPDIRECT3DTEXTURE9 pTexture;		// テクスチャ
	D3DXVECTOR3 pos;					// 位置

	int nIdx;							// 自分のiD
	bool bUse;							// 使用状況
} HealthBar;

//-----------------------------------------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitHP(void);
void UninitHP(void);
void UpdateHP(void);
void DrawHP(void);
#endif

