//=============================================================================
//
// レンダリング [renderer.h]
// Author: Sota Tomoe
//
//=============================================================================
#ifndef _RENDERER_H_
#define _RENDERER_H_

//*****************************************************************************
// ヘッダのインクルード
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// レンダラークラス
//*****************************************************************************
class CRenderer
{
public:
	CRenderer();
	~CRenderer();

	HRESULT Init(HWND hWnd, BOOL bWindow);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	LPDIRECT3DDEVICE9 GetDevice(void) { return m_pD3DDevice; }

private:
	LPDIRECT3D9 m_pD3D;									// Direct3Dオブジェクト
	LPDIRECT3DDEVICE9 m_pD3DDevice;						// デバイスオブジェクト
	D3DFILLMODE m_fillMode = D3DFILL_SOLID;				// ワイヤーフレーム

};
#endif
