//-----------------------------------------------------------------------------
//
// ポリゴンの処理 ヘッダー [polygon.h]
// Author: Souta Tomoe
//
//-----------------------------------------------------------------------------
#ifndef _POLYGON_H_
#define _POLYGON_H_
#include "main.h"

//-----------------------------------------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitPolygon(void);
void UninitPolygon(void);
void UpdatePolygon(void);
void DrawPolygon(void);

#endif

