//-----------------------------------------------------------------------------
//
// 背景ヘッダー [BG.h]
// Author: Souta Tomoe
//
//-----------------------------------------------------------------------------
#ifndef _BG_H_
#define _BG_H_
#include "main.h"

//構造体
typedef struct
{
	float x; //BGのUV移動 x
	float y; //BGのUV移動 y
}BG;

//-----------------------------------------------------------------------------
//プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitBG(void);
void UninitBG(void);
void UpdateBG(void);
void DrawBG(void);
BG GetBG(void);

#endif
