//-----------------------------------------------------------------------------
//
// リザルトヘッダー [result.h]
// Author: Souta Tomoe
//
//-----------------------------------------------------------------------------
#ifndef _RESULT_H_
#define _RESULT_H_
#include "main.h"

//-----------------------------------------------------------------------------
//プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif