//-----------------------------------------------------------------------------
//
// ランキング ヘッダー[leaderboard.h]
// Author: Souta Tomoe
//
//-----------------------------------------------------------------------------
#ifndef _LEADERBOARD_H_
#define _LEADERBOARD_H_
#include "main.h"

//-----------------------------------------------------------------------------
// RANKING構造体
//-----------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;	//位置
} RANKING;

//-----------------------------------------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitRanking(void);
void UninitRanking(void);
void UpdateRanking(void);
void DrawRanking(void);

#endif
