//-----------------------------------------------------------------------------
//
// 体力 ヘッダー [health.h]
// Author: Souta Tomoe
//
//-----------------------------------------------------------------------------
#ifndef _HEALTH_H_
#define _HEALTH_H_
#include "main.h"


//-----------------------------------------------------------------------------
//プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitHealth(void);
void UninitHealth(void);
void UpdateHealth(void);
void DrawHealth(void);

#endif

