//-----------------------------------------------------------------------------
//
// スコアの処理 ヘッダー [score.h]
// Author: Souta Tomoe
//
//-----------------------------------------------------------------------------
#ifndef _RESULTSCORE_H_
#define _RESULTSCORE_H_
#include "main.h"

//-----------------------------------------------------------------------------
//プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitRScore(void);
void UninitRScore(void);
void UpdateRScore(void);
void DrawRScore(void);

#endif
