//=============================================================================
//
// カメラ3D [camera3d.cpp]
// Author: Sota Tomoe
//
//=============================================================================
#include "camera3d.h"
#include "input.h"
#include "manager.h"
#include "player.h"
#include "game.h"
//*****************************************************************************
// カメラクラス
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CCamera3D::CCamera3D()
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CCamera3D::~CCamera3D()
{

}

//=============================================================================
// 初期化
//=============================================================================
void CCamera3D::Init(void)
{
	m_posV = D3DXVECTOR3(SCREEN_WIDTH / 2, 500.0f, SCREEN_HEIGHT / 2);
	m_posR = m_posV + D3DXVECTOR3(0.0f, -1.0f, 0.001f);
	m_vecU = D3DXVECTOR3(0.0f, 1.0f, 0.0f);
	m_rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
}

//=============================================================================
// 終了
//=============================================================================
void CCamera3D::Uninit(void)
{

}

//=============================================================================
// 更新
//=============================================================================
void CCamera3D::Update(void)
{

}

//=============================================================================
// カメラを設定
//=============================================================================
void CCamera3D::SetCamera(LPDIRECT3DDEVICE9 pDevice)
{
	// プロジェクションマトリックスの初期化
	D3DXMatrixIdentity(&m_mtxProjection);

	// プロジェクションマトリックスを生成
	D3DXMatrixPerspectiveFovLH(&m_mtxProjection, D3DXToRadian(45.0f), (float)SCREEN_WIDTH / (float)SCREEN_HEIGHT, 0.1f, 5000.0f);

	// プロジェクションマトリックスの設定
	pDevice->SetTransform(D3DTS_PROJECTION, &m_mtxProjection);

	// ビューマトリックスの初期化
	D3DXMatrixIdentity(&m_mtxView);

	// ビューマトリックスの生成
	D3DXMatrixLookAtLH(&m_mtxView, &m_posV, &m_posR, &m_vecU);

	// ビューマトリックスの設定
	pDevice->SetTransform(D3DTS_VIEW, &m_mtxView);
}