
//=============================================================================
//
// クロスヘアクラス [crosshair.cpp]
// Author: Sota Tomoe
//
//=============================================================================
#include "crosshair.h"
#include "manager.h"
#include "renderer.h"
#include "game.h"
#include "input.h"
#include "textureloader.h"

//*****************************************************************************
// 静的メンバ変数
//*****************************************************************************

//*****************************************************************************
// クロスヘアクラス ( 派生元: オブジェクトクラス (scene) )
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CCrosshair::CCrosshair()
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CCrosshair::~CCrosshair()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CCrosshair::Init(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR2 size)
{
	// 2Dオブジェクトを生成
	m_pScene2D = CScene2D::Create(pos, rot, size);
	if (m_pScene2D != NULL)
	{
		m_pScene2D->BindTexture(CManager::GetTextureLoad()->m_TextureMp["CROSSHAIR"]);
		m_pScene2D->SetConvertState(false);
		m_pScene2D->SetPriority(4);
	}

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CCrosshair::Uninit(void)
{

	// 開放処理 (sceneのポインタ配列から削除）
	Release();
}

//=============================================================================
// 更新処理
//=============================================================================
void CCrosshair::Update(void)
{
	// カーソルの位置を取得
	D3DXVECTOR2 cursorPos = CManager::GetInputMouse()->GetPos();

	// 用意した2Dオブジェクトの位置をカーソルの位置に置く
	m_pScene2D->SetPos((D3DXVECTOR3)cursorPos);

	// 頂点を更新
	m_pScene2D->UpdateVertex();
}

//=============================================================================
// 描画処理
//=============================================================================
void CCrosshair::Draw(void)
{

}

//=============================================================================
// 生成関数
//=============================================================================
CCrosshair *CCrosshair::Create(void)
{
	// 生成、初期化
	CCrosshair *pCrosshair;
	pCrosshair = new CCrosshair;
	if (pCrosshair != NULL)
	{
		pCrosshair->Init(D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0.0f), VECTOR3_ZERO, CROSSHAIR_SIZE);
	}

	return pCrosshair;
}