//=============================================================================
//
// クロスヘアクラス [crosshair.h]
// Author: Sota Tomoe
//
//=============================================================================
#ifndef _CROSSHAIR_H_
#define _CROSSHAIR_H_

//*****************************************************************************
// ヘッダーのインクルード
//*****************************************************************************
#include "scene2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define CROSSHAIR_SIZE (D3DXVECTOR2(144.0f, 144.0f))

//*****************************************************************************
// クロスヘアクラス ( 派生元: オブジェクトクラス (scene) )
//*****************************************************************************
class CCrosshair : public CScene
{
public:
	CCrosshair();
	~CCrosshair();

	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR2 size);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CCrosshair *Create(void);

private:
	CScene2D *m_pScene2D;	// クロスヘア用の2Dオブジェクト
};

#endif

